function initialize_page()
{
	Режим.подсказка('Здесь вы можете разговаривать с другими членами сети.')

	var send_button = activate_button('.send_message .send')
	.does(function()
	{
		var message = $('.send_message .message').val()
		$('.send_message .message').val('')
		болталка.emit('сообщение', message)
	})
		
	new Data_templater
	({
		template_url: '/лекала/сообщение в болталке.html',
		item_container: $('.chat'),
		conditional: $('#chat_block[type=conditional]'),
		done: chat_loaded
	},
	new  Batch_loader
	({
		url: '/приложение/болталка/сообщения',
		batch_size: 8,
		get_data: function (data) { return уплотнить_сообщения(data.сообщения) }
	}))
}

function add_message(data)
{
	var content = $.tmpl('/лекала/сообщение в болталке.html', data)
//	var item = $('<li/>')
//	content.appendTo(item)
	content.prependTo($('.chat'))
}

function chat_loaded()
{  
	connect_to_chat(function()
	{
		$('.send_message').show()
	})
}

var болталка

function connect_to_chat(callback)
{
	болталка = io.connect('http://localhost:8080/болталка', { transports: ['websocket'] })
	
	болталка.on('connect', function()
	{
		болталка.emit('пользователь', пользователь.id)
	})
	
	болталка.on('готов', function()
	{
		callback()
		// показать поле ввода и кнопку отправки
	})
	
	болталка.on('сообщение', function(данные)
	{
		add_message(уплотнить_сообщения([ данные ]))
	})
	
	болталка.on('ошибка', function(ошибка)
	{
		if (ошибка.ошибка === true)
			error('Ошибка связи с сервером')
		else
			error(ошибка)
	})
}

function уплотнить_сообщения(сообщения)
{
	var данные = { сообщения: [] }
	
	var обработанное_сообщение = {}
	сообщения.forEach(function(сообщение)
	{
		if (обработанное_сообщение.отправитель === сообщение.отправитель)
		{
			обработанное_сообщение.сообщения.push(получить_данные_сообщения(сообщение))
			return
		}
		
		обработанное_сообщение =
		{
			отправитель: сообщение.отправитель,
			сообщения: [получить_данные_сообщения(сообщение)]
		}
		данные.сообщения.push(обработанное_сообщение)
	})
	
	return данные.сообщения
}

function получить_данные_сообщения(сообщение)
{
	var данные_сообщения = 
	{
		сообщение: сообщение.сообщение,
		точное_время: Date.parse(сообщение.время, 'dd.MM.yyyy HH:mm').getTime(),
		время: неточное_время(сообщение.время),
		сейчас: new Date().getTime()
	}
	
	return данные_сообщения
}

$(function()
{	
	update_intelligent_dates.periodical(60 * 1000)
})

//
/*
var data =
{
	сообщения:
	[
		{
			отправитель: 'Иван Иванов', сообщение: 'Ицхак (Ицик) Виттенберг родился в Вильно в 1907 году в семье рабочего. Был членом подпольной коммунистической партии в Литве, после присоединения Литвы к СССР руководил профсоюзом. После оккупации Литвы немецкими войсками перешёл на нелегальное положение.', время: '24.10.2011 16:45'
		},
		{
			отправитель: 'Иван Иванов', сообщение: 'Dickinsonia (рус. дикинсония) — одно из наиболее характерных ископаемых животных эдиакарской (вендской) биоты. Как правило, представляет собой двусторонне-симметричное рифлёное овальное тело. Родственные связи организма в настоящее время неизвестны. Большинство исследователей относят дикинсоний к животным, однако существуют мнения, что они являются грибами или относятся к особому не существующему ныне царству живой природы.', время: '24.10.2011 16:46'
		},
		{
			отправитель: 'Василий Петров', сообщение: 'Овинище — Весьегонск — тупиковая однопутная 42-километровая железнодорожная линия, относящаяся к Октябрьской железной дороге, проходящая по территории Весьегонского района Тверской области (Россия) от путевого поста Овинище II, расположенного на железнодорожной линии Москва — Сонково — Мга — Санкт-Петербург (которая на разных участках называется Савёловским радиусом и Мологским ходом), до тупиковой станции Весьегонск и обеспечивающая связь расположенного на северо-восточной окраине Тверской области города Весьегонска с железнодорожной сетью страны.', время: '27.10.2011 10:20'
		}
	]
}
*/